# RadPerS Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..RadPerS Property
SymbolTypeId Class See Also
---
Symbol rad/s, indicating unit Radians per second.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId RadPerS { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RadPerS As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RadPerS {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace